print("Задание")
i1 = "Топинамбур"
print("Первый символ строки - ", i1[0])
print("Последний символ строки - ", i1[-1])
print("Вторая половина строки - ", i1[5:])
print("Строка наоборот - ", i1[::-1])
print("Строка с шагом 2 - ", i1[1::2])
i2 = "Непревзойденный"     # Свой пример
print("Свой пример")
print("Первый символ строки - ", i2[0])
print("Последний символ строки - ", i2[-1])
print("Вторая половина строки - ", i2[5:])
print("Строка наоборот - ", i2[::-1])
print("Строка с шагом 2 - ", i2[1::2])
